In [1]:
import psycopg2
import random
import pandas as pd
import numpy as np
from sqlalchemy import create_engine, text
from faker import Faker

### Set up a connection to the PostgreSQL database

In [2]:
f = open("credentials\credentials_aws.txt")
lines=f.readlines()
host=lines[0][7:-1].strip()
database=lines[1][11:].strip()
user=lines[2][7:].strip()
password=lines[3][11:].strip()
port=lines[4][7:].strip()
url=lines[5][6:].strip()
f.close()

In [3]:
print("host:", host)
print("database:", database)
print("user:", user)
print("password:", password)
print("port:", port)
print("url:", url)

host: database-1.chaf71z5ycev.eu-north-1.rds.amazonaws.com
database: database-1 # Don't use this line for AWS
user: postgres
password: edemdb1234
port: 5432
url: postgresql://postgres:edemdb1234@database-1.chaf71z5ycev.eu-north-1.rds.amazonaws.com:5432/

In [4]:
def update_db(query):
    conn = psycopg2.connect(
    host=host,
    user=user,
    password=password,
    port=port
    )

    cur = conn.cursor()

    cur.execute(query)

    conn.commit()
    cur.close()
    conn.close()

    return "Database has been updated"

In [5]:
def check_db(query):
    engine = create_engine(url)
    
    return pd.read_sql_query(text(query), con=engine.connect())

### Create "categories" table

In [ ]:
# update_db("DROP TABLE if exists categories cascade")

In [ ]:
# # Create table
# query = """
#     CREATE TABLE categories(
#         category_id SERIAL PRIMARY KEY,
#         name VARCHAR(50) NOT NULL,
#         event_id INT,
#         user_id INT,
#         CONSTRAINT fk_events FOREIGN KEY (event_id) REFERENCES events(event_id),
#         CONSTRAINT fk_users FOREIGN KEY (user_id) REFERENCES users(user_id)
#     )
# """
# update_db(query)

In [ ]:
# Create table
query = """
    CREATE TABLE categories(
        category_id SERIAL PRIMARY KEY,
        name VARCHAR(50)
    )
"""
update_db(query)

# Insert data
query = """
    INSERT INTO categories (name)
    VALUES
        ('Finance and Investment'),
        ('Management Skills'),
        ('Technology'),
        ('Business Management'),
        ('Marketing')
"""
update_db(query)

### Check "categories" table

In [6]:
query = "SELECT * FROM categories"
check_db(query)

   category_id                    name
0            1  Finance and Investment
1            2       Management Skills
2            3              Technology
3            4     Business Management
4            5               Marketing

### Create "events" table

In [ ]:
# update_db("DROP TABLE if exists events cascade")

In [ ]:
# Create table
query = """
    CREATE TABLE events(
        event_id SERIAL PRIMARY KEY,
        title VARCHAR(100),
        description TEXT,
        date TIMESTAMP,
        category_id INTEGER,
        CONSTRAINT fk_categories FOREIGN KEY (category_id) REFERENCES categories(category_id)
    )
"""
update_db(query)

# Insert data
query = """
    INSERT INTO events (title, description, date, category_id)
    VALUES
        ('HR INTERNATIONAL SUMMER SCHOOL', 'empty', '2023-06-22 00:00:00', '2'),
        ('OPEN DAY BOOTCAMPS EDEM POWERED BY THE BRIDGE', 'empty', '2023-07-04 19:00:00', '3'),
        ('ENCUENTRO CON ERIC MASKIN, PREMIO NOBEL DE ECONOM√çA 2007', 'empty', '2023-06-05 11:30:00', '1')
"""
update_db(query)

### Check "events" table

In [7]:
query = "SELECT * FROM events"
check_db(query)

,event_id,title,description,date,category_id
0,1,HR INTERNATIONAL SUMMER SCHOOL,empty,2023-06-22 00:00:00,2
1,2,OPEN DAY BOOTCAMPS EDEM POWERED BY THE BRIDGE,empty,2023-07-04 19:00:00,3
2,3,"ENCUENTRO CON ERIC MASKIN, PREMIO NOBEL DE ECO...",empty,2023-06-05 11:30:00,1

### Create "students_df" dataframe first and then convert the dataframe into SQL table

Column "gender"

In [141]:
# Set the seed value
seed_value = 42

# Set the seed for random module
random.seed(seed_value)

male_count = 481
female_count = 253

genders = []
for _ in range(male_count):
    genders.append("male")

for _ in range(female_count):
    genders.append("female")

random.shuffle(genders)

students_df = pd.DataFrame(genders, columns=["gender"])
students_df

     gender
0    female
1    female
2    female
3      male
4      male
..      ...
729    male
730    male
731    male
732    male
733  female

[734 rows x 1 columns]

Column "name"

In [142]:
fake = Faker('es_ES')

names = []
surnames = []

for gen in students_df["gender"]:
    if gen == "male":
        names.append(fake.first_name_male())
        surnames.append(fake.last_name_male())
    elif gen == "female":
        names.append(fake.first_name_female())
        surnames.append(fake.last_name_female())

students_df["name"] = names
students_df["surname"] = surnames

students_df

     gender      name    surname
0    female   Dorotea     Zapata
1    female     Leire     Madrid
2    female   Guiomar  Casta√±eda
3      male  Patricio     Larrea
4      male      Dani      Prado
..      ...       ...        ...
729    male    Donato     Bilbao
730    male     √ìscar    Delgado
731    male    V√≠ctor    Verdugo
732    male    N√©stor     Pelayo
733  female    Itziar       Jove

[734 rows x 3 columns]

Columns "programme" and "year"

In [143]:
prog_year = {
    ('BSc in Engineering and Management', '1st year'): 65, ('BSc in Engineering and Management', '2nd year'): 42, ('BSc in Engineering and Management', '3rd year'): 28, ('BSc in Engineering and Management', '4th year'): 29,
    ('BBA in Business Administration', '1st year'): 128, ('BBA in Business Administration', '2nd year'): 92, ('BBA in Business Administration', '3rd year'): 83, ('BBA in Business Administration', '4th year'): 72,
    ('Master Marketing and Digital Sales', '1st year'): 61, ('Master Marketing and Digital Sales', '2nd year'): 0, ('Master Marketing and Digital Sales', '3rd year'): 0, ('Master Marketing and Digital Sales', '4th year'): 0,
    ('Master Data Analytics', '1st year'): 30, ('Master Data Analytics', '2nd year'): 0, ('Master Data Analytics', '3rd year'): 0, ('Master Data Analytics', '4th year'): 0,
    ('Master Finance', '1st year'): 19, ('Master Finance', '2nd year'): 0, ('Master Finance', '3rd year'): 0, ('Master Finance', '4th year'): 0,
    ('MBA Junior', '1st year'): 41, ('MBA Junior', '2nd year'): 0, ('MBA Junior', '3rd year'): 0, ('MBA Junior', '4th year'): 0,
    ('Bootcamp Data Science', '1st year'): 17, ('Bootcamp Data Science', '2nd year'): 0, ('Bootcamp Data Science', '3rd year'): 0, ('Bootcamp Data Science', '4th year'): 0,
    ('Bootcamp Full Stack', '1st year'): 14, ('Bootcamp Full Stack', '2nd year'): 0, ('Bootcamp Full Stack', '3rd year'): 0, ('Bootcamp Full Stack', '4th year'): 0,
    ('Bootcamp UX/ UI', '1st year'): 7, ('Bootcamp UX/ UI', '2nd year'): 0, ('Bootcamp UX/ UI', '3rd year'): 0, ('Bootcamp UX/ UI', '4th year'): 0,
    ('Bootcamp Cibersecurity', '1st year'): 6, ('Bootcamp Cibersecurity', '2nd year'): 0, ('Bootcamp Cibersecurity', '3rd year'): 0, ('Bootcamp Cibersecurity', '4th year'): 0,
}

# Set the seed for random module
random.seed(seed_value)

students_df["prog_year"] = students_df.apply(
    lambda row: random.choices(list(prog_year.keys()), weights=list(prog_year.values()))[0],
    axis=1
)

# Create the "programme" column
students_df["programme"] = students_df["prog_year"].apply(lambda row: row[0])

# Create the "year_of_study" column
students_df["year"] = students_df["prog_year"].apply(lambda row: row[1])

students_df

,gender,name,surname,prog_year,programme,year
0,female,Dorotea,Zapata,"(BBA in Business Administration, 4th year)",BBA in Business Administration,4th year
1,female,Leire,Madrid,"(BSc in Engineering and Management, 1st year)",BSc in Engineering and Management,1st year
2,female,Guiomar,Casta√±eda,"(BBA in Business Administration, 1st year)",BBA in Business Administration,1st year
3,male,Patricio,Larrea,"(BSc in Engineering and Management, 4th year)",BSc in Engineering and Management,4th year
4,male,Dani,Prado,"(Master Marketing and Digital Sales, 1st year)",Master Marketing and Digital Sales,1st year
...,...,...,...,...,...,...
729,male,Donato,Bilbao,"(Master Marketing and Digital Sales, 1st year)",Master Marketing and Digital Sales,1st year
730,male,√ìscar,Delgado,"(BBA in Business Administration, 2nd year)",BBA in Business Administration,2nd year
731,male,V√≠ctor,Verdugo,"(BBA in Business Administration, 4th year)",BBA in Business Administration,4th year
732,male,N√©stor,Pelayo,"(MBA Junior, 1st year)",MBA Junior,1st year
733,female,Itziar,Jove,"(BSc in Engineering and Management, 3rd year)",BSc in Engineering and Management,3rd year

In [144]:
# Delete "prog_year" column
students_df = students_df.drop("prog_year", axis=1)
students_df.head()

   gender      name    surname                           programme      year
0  female   Dorotea     Zapata      BBA in Business Administration  4th year
1  female     Leire     Madrid   BSc in Engineering and Management  1st year
2  female   Guiomar  Casta√±eda      BBA in Business Administration  1st year
3    male  Patricio     Larrea   BSc in Engineering and Management  4th year
4    male      Dani      Prado  Master Marketing and Digital Sales  1st year

In [145]:
students_df.groupby("programme")["name"].count()

programme
BBA in Business Administration        373
BSc in Engineering and Management     167
Bootcamp Cibersecurity                 10
Bootcamp Data Science                  20
Bootcamp Full Stack                    12
Bootcamp UX/ UI                         7
MBA Junior                             31
Master Data Analytics                  29
Master Finance                         27
Master Marketing and Digital Sales     58
Name: name, dtype: int64

Column "email" (school_email)

In [146]:
# Generate school_email based on "first_name" and "last_name"
students_df["email"] = (students_df["name"].str.lower().str.replace(" ", "") +
                     students_df["surname"].str.lower().str.replace(" ", "") +
                     "@edem.es")

students_df

,gender,name,surname,programme,year,email
0,female,Dorotea,Zapata,BBA in Business Administration,4th year,doroteazapata@edem.es
1,female,Leire,Madrid,BSc in Engineering and Management,1st year,leiremadrid@edem.es
2,female,Guiomar,Casta√±eda,BBA in Business Administration,1st year,guiomarcasta√±eda@edem.es
3,male,Patricio,Larrea,BSc in Engineering and Management,4th year,patriciolarrea@edem.es
4,male,Dani,Prado,Master Marketing and Digital Sales,1st year,daniprado@edem.es
...,...,...,...,...,...,...
729,male,Donato,Bilbao,Master Marketing and Digital Sales,1st year,donatobilbao@edem.es
730,male,√ìscar,Delgado,BBA in Business Administration,2nd year,√≥scardelgado@edem.es
731,male,V√≠ctor,Verdugo,BBA in Business Administration,4th year,v√≠ctorverdugo@edem.es
732,male,N√©stor,Pelayo,MBA Junior,1st year,n√©storpelayo@edem.es
733,female,Itziar,Jove,BSc in Engineering and Management,3rd year,itziarjove@edem.es

Column "age"

In [147]:
# Set the seed for the random module
random.seed(seed_value)

age_range_1 = [18, 19, 20, 21, 22]
age_range_2 = [23, 24, 25, 26, 27]
age_range_3 = [x for x in range(20, 51)]

mask_1_2 = students_df["programme"].isin(['BSc in Engineering and Management', 'BBA in Business Administration'])
mask_3_to_7 = students_df["programme"].isin(['Master Marketing and Digital Sales', 'Master Data Analytics', 'Master Finance', 'MBA Junior'])
mask_8_to_13 = students_df["programme"].isin(['Bootcamp Data Science', 'Bootcamp Full Stack', 'Bootcamp UX/ UI', 'Bootcamp Cibersecurity'])

students_df.loc[mask_1_2, "age"] = random.choices(age_range_1, weights=[5, 3, 1, 1, 0], k=mask_1_2.sum())
students_df.loc[mask_3_to_7, "age"] = random.choices(age_range_2, weights=[2, 2, 2, 2, 2], k=mask_3_to_7.sum())

weights_3_to_13 = [1 / (x - 19) for x in range(20, 51)]
students_df.loc[mask_8_to_13, "age"] = random.choices(age_range_3, weights=weights_3_to_13, k=mask_8_to_13.sum())

students_df

,gender,name,surname,programme,year,email,age
0,female,Dorotea,Zapata,BBA in Business Administration,4th year,doroteazapata@edem.es,19.0
1,female,Leire,Madrid,BSc in Engineering and Management,1st year,leiremadrid@edem.es,18.0
2,female,Guiomar,Casta√±eda,BBA in Business Administration,1st year,guiomarcasta√±eda@edem.es,18.0
3,male,Patricio,Larrea,BSc in Engineering and Management,4th year,patriciolarrea@edem.es,18.0
4,male,Dani,Prado,Master Marketing and Digital Sales,1st year,daniprado@edem.es,27.0
...,...,...,...,...,...,...,...
729,male,Donato,Bilbao,Master Marketing and Digital Sales,1st year,donatobilbao@edem.es,23.0
730,male,√ìscar,Delgado,BBA in Business Administration,2nd year,√≥scardelgado@edem.es,19.0
731,male,V√≠ctor,Verdugo,BBA in Business Administration,4th year,v√≠ctorverdugo@edem.es,19.0
732,male,N√©stor,Pelayo,MBA Junior,1st year,n√©storpelayo@edem.es,23.0
733,female,Itziar,Jove,BSc in Engineering and Management,3rd year,itziarjove@edem.es,18.0

In [148]:
# Change "age" column dtype
students_df = students_df.astype({"age": "int64"})

students_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 734 entries, 0 to 733
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   gender     734 non-null    object
 1   name       734 non-null    object
 2   surname    734 non-null    object
 3   programme  734 non-null    object
 4   year       734 non-null    object
 5   email      734 non-null    object
 6   age        734 non-null    int64
dtypes: int64(1), object(6)
memory usage: 40.3+ KB

Arrange the "students_df" columns

In [149]:
students_df.columns

Index(['gender', 'name', 'surname', 'programme', 'year', 'email', 'age'], dtype='object')

In [150]:
students_df = students_df[["name", "surname", "gender", "age", "year", "email", "programme"]]
students_df

,name,surname,gender,age,year,email,programme
0,Dorotea,Zapata,female,19,4th year,doroteazapata@edem.es,BBA in Business Administration
1,Leire,Madrid,female,18,1st year,leiremadrid@edem.es,BSc in Engineering and Management
2,Guiomar,Casta√±eda,female,18,1st year,guiomarcasta√±eda@edem.es,BBA in Business Administration
3,Patricio,Larrea,male,18,4th year,patriciolarrea@edem.es,BSc in Engineering and Management
4,Dani,Prado,male,27,1st year,daniprado@edem.es,Master Marketing and Digital Sales
...,...,...,...,...,...,...,...
729,Donato,Bilbao,male,23,1st year,donatobilbao@edem.es,Master Marketing and Digital Sales
730,√ìscar,Delgado,male,19,2nd year,√≥scardelgado@edem.es,BBA in Business Administration
731,V√≠ctor,Verdugo,male,19,4th year,v√≠ctorverdugo@edem.es,BBA in Business Administration
732,N√©stor,Pelayo,male,23,1st year,n√©storpelayo@edem.es,MBA Junior
733,Itziar,Jove,female,18,3rd year,itziarjove@edem.es,BSc in Engineering and Management

Double check whether the "users_df" data is aligned with the data provided by EDEM

In [151]:
students_df.groupby("programme")["email"].count()

programme
BBA in Business Administration        373
BSc in Engineering and Management     167
Bootcamp Cibersecurity                 10
Bootcamp Data Science                  20
Bootcamp Full Stack                    12
Bootcamp UX/ UI                         7
MBA Junior                             31
Master Data Analytics                  29
Master Finance                         27
Master Marketing and Digital Sales     58
Name: email, dtype: int64

In [152]:
students_df.groupby(["programme", "year"])["email"].count()

programme                           year
BBA in Business Administration      1st year    122
                                    2nd year     89
                                    3rd year     85
                                    4th year     77
BSc in Engineering and Management   1st year     64
                                    2nd year     40
                                    3rd year     24
                                    4th year     39
Bootcamp Cibersecurity              1st year     10
Bootcamp Data Science               1st year     20
Bootcamp Full Stack                 1st year     12
Bootcamp UX/ UI                     1st year      7
MBA Junior                          1st year     31
Master Data Analytics               1st year     29
Master Finance                      1st year     27
Master Marketing and Digital Sales  1st year     58
Name: email, dtype: int64

In [153]:
students_df.groupby("gender")["email"].count()

gender
female    253
male      481
Name: email, dtype: int64

In [154]:
students_df.groupby(["programme", "year", "gender"])["email"].count()

programme                           year      gender
BBA in Business Administration      1st year  female    32
                                              male      90
                                    2nd year  female    30
                                              male      59
                                    3rd year  female    29
                                              male      56
                                    4th year  female    30
                                              male      47
BSc in Engineering and Management   1st year  female    24
                                              male      40
                                    2nd year  female    14
                                              male      26
                                    3rd year  female     9
                                              male      15
                                    4th year  female    13
                                              male      26
Bootcamp Cibersecurity              1st year  female     2
                                              male       8
Bootcamp Data Science               1st year  female     8
                                              male      12
Bootcamp Full Stack                 1st year  female     4
                                              male       8
Bootcamp UX/ UI                     1st year  female     2
                                              male       5
MBA Junior                          1st year  female    10
                                              male      21
Master Data Analytics               1st year  female    10
                                              male      19
Master Finance                      1st year  female     5
                                              male      22
Master Marketing and Digital Sales  1st year  female    31
                                              male      27
Name: email, dtype: int64

Comment:
- The number of students per gender that was randomly generated, is the same as the one provided by EDEM, but when we tried to break it down based on the programmes/majors and year of study, there is a slight difference in the figures generated randomly (distribution of the data). 
- Overall, the random data is quite aligned with the data provided by EDEM.

Create "category_id" column

In [155]:
query = "SELECT * FROM categories"
category_id_df = check_db(query)
category_id_df

   category_id                    name
0            1  Finance and Investment
1            2       Management Skills
2            3              Technology
3            4     Business Management
4            5               Marketing

In [156]:
category_id_df["category_id"].to_list()

[1, 2, 3, 4, 5]

In [157]:
interests = category_id_df["category_id"].to_list()

random.seed(seed_value)

def generate_categories(row):
    num_categories = random.randint(1, len(interests))
    categories = random.sample(interests, k=num_categories)
    return categories

students_df["category_id"] = students_df.apply(generate_categories, axis=1)

students_df

,name,surname,gender,age,year,email,programme,category_id
0,Dorotea,Zapata,female,19,4th year,doroteazapata@edem.es,BBA in Business Administration,[1]
1,Leire,Madrid,female,18,1st year,leiremadrid@edem.es,BSc in Engineering and Management,"[2, 5, 1]"
2,Guiomar,Casta√±eda,female,18,1st year,guiomarcasta√±eda@edem.es,BBA in Business Administration,[5]
3,Patricio,Larrea,male,18,4th year,patriciolarrea@edem.es,BSc in Engineering and Management,[5]
4,Dani,Prado,male,27,1st year,daniprado@edem.es,Master Marketing and Digital Sales,"[1, 5, 4, 3]"
...,...,...,...,...,...,...,...,...
729,Donato,Bilbao,male,23,1st year,donatobilbao@edem.es,Master Marketing and Digital Sales,"[2, 4, 5, 3]"
730,√ìscar,Delgado,male,19,2nd year,√≥scardelgado@edem.es,BBA in Business Administration,"[3, 2, 5]"
731,V√≠ctor,Verdugo,male,19,4th year,v√≠ctorverdugo@edem.es,BBA in Business Administration,"[3, 1, 4, 5]"
732,N√©stor,Pelayo,male,23,1st year,n√©storpelayo@edem.es,MBA Junior,"[1, 5, 4, 2]"
733,Itziar,Jove,female,18,3rd year,itziarjove@edem.es,BSc in Engineering and Management,"[1, 4, 5, 3]"

In [158]:
# Check whether or not there is a repetition in category list per each row
def check_category_repetition(row):
    categories = row["category_id"]
    return len(categories) != len(set(categories))

students_df["repeated_categories"] = students_df.apply(check_category_repetition, axis=1)

students_df

,name,surname,gender,age,year,email,programme,category_id,repeated_categories
0,Dorotea,Zapata,female,19,4th year,doroteazapata@edem.es,BBA in Business Administration,[1],False
1,Leire,Madrid,female,18,1st year,leiremadrid@edem.es,BSc in Engineering and Management,"[2, 5, 1]",False
2,Guiomar,Casta√±eda,female,18,1st year,guiomarcasta√±eda@edem.es,BBA in Business Administration,[5],False
3,Patricio,Larrea,male,18,4th year,patriciolarrea@edem.es,BSc in Engineering and Management,[5],False
4,Dani,Prado,male,27,1st year,daniprado@edem.es,Master Marketing and Digital Sales,"[1, 5, 4, 3]",False
...,...,...,...,...,...,...,...,...,...
729,Donato,Bilbao,male,23,1st year,donatobilbao@edem.es,Master Marketing and Digital Sales,"[2, 4, 5, 3]",False
730,√ìscar,Delgado,male,19,2nd year,√≥scardelgado@edem.es,BBA in Business Administration,"[3, 2, 5]",False
731,V√≠ctor,Verdugo,male,19,4th year,v√≠ctorverdugo@edem.es,BBA in Business Administration,"[3, 1, 4, 5]",False
732,N√©stor,Pelayo,male,23,1st year,n√©storpelayo@edem.es,MBA Junior,"[1, 5, 4, 2]",False
733,Itziar,Jove,female,18,3rd year,itziarjove@edem.es,BSc in Engineering and Management,"[1, 4, 5, 3]",False

In [159]:
students_df["repeated_categories"].unique()

array([False])

In [160]:
# Remove the "repeated_categories" column
students_df = students_df.drop("repeated_categories", axis=1)

In [161]:
students_df

,name,surname,gender,age,year,email,programme,category_id
0,Dorotea,Zapata,female,19,4th year,doroteazapata@edem.es,BBA in Business Administration,[1]
1,Leire,Madrid,female,18,1st year,leiremadrid@edem.es,BSc in Engineering and Management,"[2, 5, 1]"
2,Guiomar,Casta√±eda,female,18,1st year,guiomarcasta√±eda@edem.es,BBA in Business Administration,[5]
3,Patricio,Larrea,male,18,4th year,patriciolarrea@edem.es,BSc in Engineering and Management,[5]
4,Dani,Prado,male,27,1st year,daniprado@edem.es,Master Marketing and Digital Sales,"[1, 5, 4, 3]"
...,...,...,...,...,...,...,...,...
729,Donato,Bilbao,male,23,1st year,donatobilbao@edem.es,Master Marketing and Digital Sales,"[2, 4, 5, 3]"
730,√ìscar,Delgado,male,19,2nd year,√≥scardelgado@edem.es,BBA in Business Administration,"[3, 2, 5]"
731,V√≠ctor,Verdugo,male,19,4th year,v√≠ctorverdugo@edem.es,BBA in Business Administration,"[3, 1, 4, 5]"
732,N√©stor,Pelayo,male,23,1st year,n√©storpelayo@edem.es,MBA Junior,"[1, 5, 4, 2]"
733,Itziar,Jove,female,18,3rd year,itziarjove@edem.es,BSc in Engineering and Management,"[1, 4, 5, 3]"

In [162]:
# Test category mapping
category_map = list(category_id_df.set_index("category_id").to_dict().values())[0]
category_map

{1: 'Finance and Investment',
 2: 'Management Skills',
 3: 'Technology',
 4: 'Business Management',
 5: 'Marketing'}

In [163]:
students_df['category'] = students_df['category_id'].apply(lambda x: [category_map.get(category) for category in x])
students_df

,name,surname,gender,age,year,email,programme,category_id,category
0,Dorotea,Zapata,female,19,4th year,doroteazapata@edem.es,BBA in Business Administration,[1],[Finance and Investment]
1,Leire,Madrid,female,18,1st year,leiremadrid@edem.es,BSc in Engineering and Management,"[2, 5, 1]","[Management Skills, Marketing, Finance and Inv..."
2,Guiomar,Casta√±eda,female,18,1st year,guiomarcasta√±eda@edem.es,BBA in Business Administration,[5],[Marketing]
3,Patricio,Larrea,male,18,4th year,patriciolarrea@edem.es,BSc in Engineering and Management,[5],[Marketing]
4,Dani,Prado,male,27,1st year,daniprado@edem.es,Master Marketing and Digital Sales,"[1, 5, 4, 3]","[Finance and Investment, Marketing, Business M..."
...,...,...,...,...,...,...,...,...,...
729,Donato,Bilbao,male,23,1st year,donatobilbao@edem.es,Master Marketing and Digital Sales,"[2, 4, 5, 3]","[Management Skills, Business Management, Marke..."
730,√ìscar,Delgado,male,19,2nd year,√≥scardelgado@edem.es,BBA in Business Administration,"[3, 2, 5]","[Technology, Management Skills, Marketing]"
731,V√≠ctor,Verdugo,male,19,4th year,v√≠ctorverdugo@edem.es,BBA in Business Administration,"[3, 1, 4, 5]","[Technology, Finance and Investment, Business ..."
732,N√©stor,Pelayo,male,23,1st year,n√©storpelayo@edem.es,MBA Junior,"[1, 5, 4, 2]","[Finance and Investment, Marketing, Business M..."
733,Itziar,Jove,female,18,3rd year,itziarjove@edem.es,BSc in Engineering and Management,"[1, 4, 5, 3]","[Finance and Investment, Business Management, ..."

Create "student_id" column

In [164]:
students_df.columns

Index(['name', 'surname', 'gender', 'age', 'year', 'email', 'programme',
       'category_id', 'category'],
      dtype='object')

In [165]:
# Add "student_id" column into "students_df" dataframe. This column will be a primary key in SQL and will be filled in automatically in SQL
students_df["student_id"] = [x for x in range (1, 735)]

# Put the "student_id" in the first column
students_df = students_df[['student_id', 'email', 'name', 'surname', 'gender', 'age', 'programme', 'year', 'category_id', 
                           'category']]

students_df.head()

,student_id,email,name,surname,gender,age,programme,year,category_id,category
0,1,doroteazapata@edem.es,Dorotea,Zapata,female,19,BBA in Business Administration,4th year,[1],[Finance and Investment]
1,2,leiremadrid@edem.es,Leire,Madrid,female,18,BSc in Engineering and Management,1st year,"[2, 5, 1]","[Management Skills, Marketing, Finance and Inv..."
2,3,guiomarcasta√±eda@edem.es,Guiomar,Casta√±eda,female,18,BBA in Business Administration,1st year,[5],[Marketing]
3,4,patriciolarrea@edem.es,Patricio,Larrea,male,18,BSc in Engineering and Management,4th year,[5],[Marketing]
4,5,daniprado@edem.es,Dani,Prado,male,27,Master Marketing and Digital Sales,1st year,"[1, 5, 4, 3]","[Finance and Investment, Marketing, Business M..."

In [166]:
students_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 734 entries, 0 to 733
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   student_id   734 non-null    int64
 1   email        734 non-null    object
 2   name         734 non-null    object
 3   surname      734 non-null    object
 4   gender       734 non-null    object
 5   age          734 non-null    int64
 6   programme    734 non-null    object
 7   year         734 non-null    object
 8   category_id  734 non-null    object
 9   category     734 non-null    object
dtypes: int64(2), object(8)
memory usage: 57.5+ KB

In [167]:
# Save the dataframe in CSV for ML training purpose
students_df.to_csv("data_ds/students_df.csv")

Convert the "students_df" dataframe into "students" table in PostgreSQL

In [171]:
# update_db("DROP TABLE if exists students cascade")

'Database has been updated'

In [172]:
# Create table
query = """
	CREATE TABLE students(
		student_id SERIAL PRIMARY KEY,
        email VARCHAR(255),
		name VARCHAR(255),
		surname VARCHAR(255),
		gender VARCHAR(10),
		age INTEGER,
		programme VARCHAR(255),
        year VARCHAR(20),
        category_id INTEGER[],
        category TEXT[]
	)
"""
update_db(query)

'Database has been updated'

In [173]:
students_df.columns

Index(['student_id', 'email', 'name', 'surname', 'gender', 'age', 'programme',
       'year', 'category_id', 'category'],
      dtype='object')

In [174]:
def insert_users_db(query, values):
    conn = psycopg2.connect(
        host=host,
        user=user,
        password=password,
        port=port
        )

    cur = conn.cursor()

    cur.execute(query, values)

    conn.commit()
    cur.close()
    conn.close()

    return "Database has been updated"

# Iterate over each row in the DataFrame and insert data into the "students" table
for index, row in students_df.iterrows():
    student_id = row['student_id']
    email = row['email']
    name = row['name']
    surname = row['surname']
    gender = row['gender']
    age = row['age']
    programme = row['programme']
    year = row['year']
    category_id = row['category_id']
    category = row['category']

    # Generate the SQL query with placeholders for parameters
    query = "INSERT INTO students (student_id, email, name, surname, gender, age, programme, year, category_id, category) " \
            "VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)"

    # Create a tuple of values to be inserted into the query
    values = (student_id, email, name, surname, gender, age, programme, year, category_id, category)

    # Call the update_db function to execute the query with the parameter values
    insert_users_db(query, values)

print("Data insertion into the 'students' table is complete.")

Data insertion into the 'students' table is complete.

In [175]:
check_db("SELECT * FROM students")

,student_id,email,name,surname,gender,age,programme,year,category_id,category
0,1,doroteazapata@edem.es,Dorotea,Zapata,female,19,BBA in Business Administration,4th year,[1],[Finance and Investment]
1,2,leiremadrid@edem.es,Leire,Madrid,female,18,BSc in Engineering and Management,1st year,"[2, 5, 1]","[Management Skills, Marketing, Finance and Inv..."
2,3,guiomarcasta√±eda@edem.es,Guiomar,Casta√±eda,female,18,BBA in Business Administration,1st year,[5],[Marketing]
3,4,patriciolarrea@edem.es,Patricio,Larrea,male,18,BSc in Engineering and Management,4th year,[5],[Marketing]
4,5,daniprado@edem.es,Dani,Prado,male,27,Master Marketing and Digital Sales,1st year,"[1, 5, 4, 3]","[Finance and Investment, Marketing, Business M..."
...,...,...,...,...,...,...,...,...,...,...
729,730,donatobilbao@edem.es,Donato,Bilbao,male,23,Master Marketing and Digital Sales,1st year,"[2, 4, 5, 3]","[Management Skills, Business Management, Marke..."
730,731,√≥scardelgado@edem.es,√ìscar,Delgado,male,19,BBA in Business Administration,2nd year,"[3, 2, 5]","[Technology, Management Skills, Marketing]"
731,732,v√≠ctorverdugo@edem.es,V√≠ctor,Verdugo,male,19,BBA in Business Administration,4th year,"[3, 1, 4, 5]","[Technology, Finance and Investment, Business ..."
732,733,n√©storpelayo@edem.es,N√©stor,Pelayo,male,23,MBA Junior,1st year,"[1, 5, 4, 2]","[Finance and Investment, Marketing, Business M..."
733,734,itziarjove@edem.es,Itziar,Jove,female,18,BSc in Engineering and Management,3rd year,"[1, 4, 5, 3]","[Finance and Investment, Business Management, ..."